АлогистикТест2/src/Documents/алк_ПогрузкаСудовыхПартий/алк_ПогрузкаСудовыхПартий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПогрузкаСудовыхПартий</name>
  <basedOn>Document.алк_ТранспортировочныеПартии</basedOn>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаВнешнихСкладахСерии</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ТранспортировочныеПартии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЭкспедитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/ОперацииСерийныхНомеров/ОперацииСерийныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииСерийныхНомеров</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Движение</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
  <enumValues>
    <name>Расформирование</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Перевалка</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПогрузкаСудовыхПартий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПогрузкаСудовыхПартий, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПогрузкаСудовыхПартийЗапасы.СерийныйНомер,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	&Период,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура,
		|	алк_ПогрузкаСудовыхПартийЗапасы.КоличествоПакетов,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Заказ КАК ЗаказПокупателя,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Организация,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.СтруктурнаяЕдиница
		|ИЗ
		|	Документ.алк_ПогрузкаСудовыхПартий.Запасы КАК алк_ПогрузкаСудовыхПартийЗапасы
		|ГДЕ
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Дата КАК ДатаСобытия,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Дата КАК Период,
		|	алк_ПогрузкаСудовыхПартийЗапасы.СерийныйНомер,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Судно) КАК Операция,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика
		|ИЗ
		|	Документ.алк_ПогрузкаСудовыхПартий.Запасы КАК алк_ПогрузкаСудовыхПартийЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_ПогрузкаСудовыхПартийЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Организация,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Характеристика,
		|	ВЫБОР
		|		КОГДА алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|		ИНАЧЕ алк_ПогрузкаСудовыхПартийЗапасы.СерийныйНомер
		|	КОНЕЦ КАК СерийныйНомер,
		|	ВЫБОР
		|		КОГДА алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА алк_ПогрузкаСудовыхПартийЗапасы.ВесНетто
		|		ИНАЧЕ алк_ПогрузкаСудовыхПартийЗапасы.ОбъемТаможня
		|	КОНЕЦ КАК Количество,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.алк_ПогрузкаСудовыхПартий.Запасы КАК алк_ПогрузкаСудовыхПартийЗапасы
		|ГДЕ
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка = &Ссылка
		|	И алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура.Код = ""ПБ-00000018""";

		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПогрузкаСудовыхПартий);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПогрузкаСудовыхПартий.Дата);
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаВнСкладахСерии", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", МассивРезультатов[2].Выгрузить());   // Только для пеллет: алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура.Код = "ПБ-00000018"
		

	КонецПроцедуры
	
	
	#КонецОбласти
	
	
#КонецЕсли
